// var доступна во всей области функции и ее можно изменить 
var one = 1

// переменная доступна только внутри блока обозначенной {} и ее можно изменить в области 
let three = 3

// как let но изменить нельзя и ее нужно использовать как можно чаще в коде
const two = 2 

// let например используют в цикле 
// так var используют редко т.к. let и const покрывают почти все задачи, но всегда есть исключения 

// Типы данные 
// во первых тут пиздец
// так то все базово, а именно тут есть числа (в том числе float) строки, лог. значения, даты, функции, 
// объекты и массивы.
// еще есть всякая спеуиальная херня

// немножко дрочева)))))

let myVariable = 123;
myVariable = 321;